{
  "1-1": "[T1] This level starts out on a flat, open path.\n\n[T2] As Mario or Luigi moves forward, a Little Goomba appears and starts walking towards them.\n\n[T3] They then reach the first ? Block of the game.\n\n[T4] Afterward, they encounter the six-block triangle formation of ? Blocks and regular bricks, with a Magic Mushroom inside the left block.\n\n[T5] A set of three Pipes can be found, with Little Goombas located in between them.\n\n[T6] The final pipe among the set leads to a bonus area with 19 coins and can be entered to bypass much of the level, exiting at the fifth pipe near the end.\n\n[T7] If the pipe is not taken, a hidden 1-Up Mushroom block appears just after the pipes.\n\n[T8] A pit follows, then another ? Block containing either a Magic Mushroom or Fire Flower, depending on the player’s form.\n\n[T9] Little Goombas start falling down from a long row of blocks above.\n\n[T10] A brick down below contains ten coins that can be retrieved by jumping repeatedly underneath it.\n\n[T11] Two bricks after that—the second one contains a Starman.\n\n[T12] Another ?-Block triangle appears; the top block holds a Fire Flower (or a Magic Mushroom if Mario is small).\n\n[T13] A Koopa Troopa and more Little Goombas appear ahead.\n\n[T14] Bricks and ? Blocks line the path, followed by a pyramid-like set of Hard Blocks with a gap in the middle.\n\n[T15] Another pyramid-like set of blocks appears, this time with a pit in the middle.\n\n[T16] A pipe that cannot be entered—the exit from the bonus area—comes next, followed by two Little Goombas and four blocks in a row (three bricks and a coin-holding ? Block).\n\n[T17] Another inaccessible pipe stands just before the ending staircase of bricks.\n\n[T18] The level concludes with the staircase and the flagpole reused in underground and underwater stages.",
  "1-2": "[T1] The player starts the level by falling through a hole in the roof beside a pipe.\n\n[T2] Two Little Goombas and five ? Blocks await; the first holds a Magic Mushroom or Fire Flower, while the other four hold coins.\n\n[T3] A block-tower structure stands nearby, with a Little Goomba and a Brick Block containing ten coins.\n\n[T4] Ahead are several Brick Blocks, one containing a Starman and coins, with two Koopa Troopas underneath.\n\n[T5] The player reaches an area filled with Brick Blocks along with a Koopa Troopa and five Little Goombas.\n\n[T6] By breaking the Brick Blocks, the player can reach and walk across the top of the level.\n\n[T7] A Brick Block with a Magic Mushroom or Fire Flower and a masked Brick Block with ten coins can be found.\n\n[T8] A pit appears, followed by a Block platform that yields a 1-Up Mushroom.\n\n[T9] The path continues past two Little Goombas and three pipes, all containing Piranha Plants.\n\n[T10] The first pipe leads to a room with 27 coins and a 10-Coin Brick Block.\n\n[T11] A Warp Pipe on the right returns the player to the third pipe in the main area.\n\n[T12] Two gaps follow, with two ground blocks and some Brick Blocks between them.\n\n[T13] A small half-pyramid structure with two Little Goombas appears.\n\n[T14] Moving lifts rise and fall ahead; the first moves down while the right one moves up.\n\n[T15] Between the lifts is a platform with a Koopa Troopa and Brick Blocks; the rightmost block contains a power-up.\n\n[T16] The player reaches a Pipe that leads to the final area.\n\n[T17] Using the lifts, the player can access a Warp Zone hidden through the roof; from right to left, the pipes lead to Worlds 2, 3, and 4.\n\n[T18] This also allows access to the Minus World if the player goes through the wall.\n\n[T19] Taking the regular pipe leads to an overworld area with a Piranha Plant pipe, a staircase of Hard Blocks, and the flagpole."
}