{
    "ckpt1": [
        "You found the body at 1:00 PM. You're sure?",
        "Yes. It was 1:00 PM, for certain.",
        "Frankly, I find that hard to believe!",
        "Your statement directly contradicts the autopsy report.",
        "The autopsy notes the time of death at sometime after 4PM.",
        "There was nobody to... er... no \"body\" to find at 1:00 PM!",
        "How do you explain this three-hour gap?",
        "Oh, that! Oh, er...",
        "This is trivial! The witness merely forgot the time!",
        "After his testimony, I find that hard to believe.",
        "Why were you so certain that you found the body at 1:00 PM?",
        "I... er... well, I... Gee, that's a really good question!",
        "Great job, Wright! Way to put him on the spot!",
        "That's all you have to do: point out contradictions!",
        "Lies always beget more lies!",
        "See through one, and their whole story falls apart!",
        "Wait! I remember now!",
        "Would you care to give your testimony again?",
        "You see, when I found the body, I heard the time.",
        "There was a voice saying the time... It was probably coming from the television.",
        "Oh, but it was three hours off, wasn't it?",
        "I guess the victim must have been watching a video of a taped program!",
        "That's why I thought it was 1:00 PM!",
        "Terribly sorry about the misunderstanding...",
        "Mr. Wright, you may cross-examine the witness.",
        "You know what to do!",
        "I've got this one."
      ],
    "ckpt2":[
        "You couldn't have heard a television... or a video!",
        "Gah!!!",
        "I... well... urk!",
        "The defense has a point.",
        "Do you have an explanation for this, Mr. Sahwit?",
        "No, I... I find it quite puzzling myself! Quite!",
        "W-wait! I remember now!",
        "The court would prefer to hear an accurate testimony from the very beginning.",
        "These constant corrections are harming your credibility.",
        "That, and you seem rather... distraught.",
        "M-my apologies, Your Honor!",
        "It... er, it must have been the shock of finding",
        "the body!",
        "Let's hear your testimony once more please.",
        "Actually, I didn't \"hear\" the time... I \"saw\" it!",
        "There was a table clock in the apartment, wasn't there!",
        "Yeah, the murder weapon! The killer used it to hit the victim!",
        "That must have been what I saw.",
        "You saw a clock? I guess that would explain it.",
        "The defense may cross-examine the witness.",
        "Gladly."
      ],
    "ckpt3":[
        "The murder weapon wasn't a clock. It was this statue!",
        "Now how is this supposed to be a clock?",
        "Y-you with your \"objections,\" and your \"evidence\"... Just who do you think you are",
        "Just answer the question, Mr. Sahwit.",
        "Hey, I... I saw it there, okay! That's a clock!",
        "As the witness stated, this statue is indeed a clock.",
        "The neck is a switch. You just tilt it, and it says the time out loud.",
        "As it doesn't look like a clock, I submitted it as a statue. My apologies.",
        "So the murder weapon was a table clock after all.",
        "It appears that the witness's testimony was correct."
      ]
}