{
    "ckpt1": [
        "You found the body at 1:00 PM. You're sure?",
        "Yes. It was 1:00 PM, for certain.",
        "Frankly, I find that hard to believe!",
        "Your statement directly contradicts the autopsy report.",
        "The autopsy notes the time of death at sometime after 4PM.",
        "There was nobody to... er... no \"body\" to find at 1:00 PM!",
        "How do you explain this three-hour gap?",
        "Oh, that! Oh, er...",
        "This is trivial! The witness merely forgot the time!",
        "After his testimony, I find that hard to believe.",
        "Why were you so certain that you found the body at 1:00 PM?",
        "I... er... well, I... Gee, that's a really good question!",
        "Great job, Wright! Way to put him on the spot!",
        "That's all you have to do: point out contradictions!",
        "Lies always beget more lies!",
        "See through one, and their whole story falls apart!",
        "Wait! I remember now!",
        "Would you care to give your testimony again?",
        "You see, when I found the body, I heard the time.",
        "There was a voice saying the time... It was probably coming from the television.",
        "Oh, but it was three hours off, wasn't it?",
        "I guess the victim must have been watching a video of a taped program!",
        "That's why I thought it was 1:00 PM!",
        "Terribly sorry about the misunderstanding...",
        "Mr. Wright, you may cross-examine the witness.",
        "You know what to do!",
        "I've got this one."
      ],
    "ckpt2":[
        "You couldn't have heard a television... or a video!",
        "Gah!!!",
        "I... well... urk!",
        "The defense has a point.",
        "Do you have an explanation for this, Mr. Sahwit?",
        "No, I... I find it quite puzzling myself! Quite!",
        "W-wait! I remember now!",
        "The court would prefer to hear an accurate testimony from the very beginning.",
        "These constant corrections are harming your credibility.",
        "That, and you seem rather... distraught.",
        "M-my apologies, Your Honor!",
        "It... er, it must have been the shock of finding",
        "the body!",
        "Let's hear your testimony once more please.",
        "Actually, I didn't \"hear\" the time... I \"saw\" it!",
        "There was a table clock in the apartment, wasn't there!",
        "Yeah, the murder weapon! The killer used it to hit the victim!",
        "That must have been what I saw.",
        "You saw a clock? I guess that would explain it.",
        "The defense may cross-examine the witness.",
        "Gladly."
      ],
    "ckpt3":[
        "The murder weapon wasn't a clock. It was this statue!",
        "Now how is this supposed to be a clock?",
        "Y-you with your \"objections,\" and your \"evidence\"... Just who do you think you are",
        "Just answer the question, Mr. Sahwit.",
        "Hey, I... I saw it there, okay! That's a clock!",
        "As the witness stated, this statue is indeed a clock.",
        "The neck is a switch. You just tilt it, and it says the time out loud.",
        "As it doesn't look like a clock, I submitted it as a statue. My apologies.",
        "So the murder weapon was a table clock after all.",
        "It appears that the witness's testimony was correct.",
        "You were inside the apartment on the day of the murder!",
        "Oh yeah? Prove it! Prove I went in there!",
        "I'll do better than that! I can prove you were the one who killed her!",
        "You struck her with the clock, and the shock of the blow triggered the clock's voice!",
        "That was the sound you heard!",
        "The sound must have left quite an impression on you.",
        "Understandable, since the murder weapon spoke just as you hit t",
        "That voice was burned into your mind.",
        "That's why you were so certain about the time!",
        "W-w-what's the meaning of this?",
        "This is all baseless conjecture!",
        "Baseless...?",
        "Would the witness care to elaborate?",
        "Did you strike the victim with the clock?",
        "I... I...! That... that day... I... I never!",
        "I-it was him, I tell you! I saw him!",
        "H-he killed her and he should burn! Burn! Give him death!",
        "There isn't a shred of evidence supporting the defense's claims!",
        "You claim the sound the witness heard came from the clock...",
        "Do you have any evidence?",
        "(The whole case is riding on this! I'd better think it through carefully!)",
        "The sound Mr. Sahwit heard was definitely this clock."
      ],
    "ckpt4":[
        "I ask the court to listen very carefully...",
        "That certainly is a strange way to announ",
        "Well, he is \"The Thinker,\" after all.",
        "So, we've heard the clock. What are your conclusions, Mr. Wright?",
        "Mr. Payne... can you tell me what time it is now?",
        "As you can see, this clock is exactly three hours slow!",
        "Precisely the discrepancy between what Mr. Sahwit heard and the actual time of death!",
        "Try to talk your way out of this one!",
        "While it may seem like that clock IS running three hours slow...",
        "It proves nothing!",
        "How do you know it was running three hours slow on the day of the murder!?",
        "If you can't prove that, you don't have a case!",
        "He's right! How am I going to prove that!?)",
        "It seems you lack the critical evidence to support your claim.",
        "This means I cannot let you indict the witness.",
        "This ends the cross-examination of Mr. Frank Sahwit.",
        "I come all the way down here to testify, and look what happens!",
        "You treat me like a criminal! A criminal!",
        "You lawyers are all slime!",
        "There's nothing I can do about it now...)",
        "Not so fast, Mr. Sahwit!",
        "Mia! I mean, Chief!",
        "Listen up, Wright!",
        "Don't throw this one away, not like this! Think!",
        "But, Chief, it's over.",
        "I can't prove the clock was slow the day of the murder!",
        "Nobody can prove that!",
        "But that doesn't mean you can't still win! Try thinking out of the box!",
        "Don't waste time doubting the facts. Assume the clock was three hours slow and...",
        "Think through it!",
        "Ask yourself, \"Why was the clock three hours slow?\"",
        "Figure out the reason, and you'll have your proof!",
        "Can you think of a reason as to why the clock would be three hours slow?",
        "You must have evidence somewhere that can prove it, Wright!",
        "Find it and let them have it!",
        "You say the clock was already running slow on the day of the murder...",
        "Have you found evidence to support this claim?"
    ], 
    "ckpt5": [
      "As we all know, the time difference between here and",
      "Paris is nine hours!",
      "He... er... He was arrested and has been taken away, Your Honor.",
      "This case has certainly turned out differently than we all expected.",
      "Mr. Payne... Your witness?",
      "This court finds the defendant, Mr. Larry Butz...",
      "The victim had just returned home from abroad the day",
      "before the murder.",
      "When it's 4:00 PM here, it's 1:00 AM the next day",
      "there.",
      "The victim hadn't reset her clock since returning home!",
      "I say... Mr. Did It!"
    ],
    "ckpt6": [
      "If I heard correctly... You said you arrested her because you had \"hard evidence\" she did it, correct?",
      "Huh? Did... did I say that? Me?",
      "I heard you say it!",
      "Exactly what about this suspicious woman in pink's claim was 'hard evidence'!?",
      "Miss May isn't suspicious, and she sure isn't pink, pal!",
      "W-well, I guess she is pink...",
      "That's enough, Detective Gumshoe.",
      "Do you have any more solid proof other than her claims, Detective?.",
      "Hmm! I guess pressing can have its advantages!)",
      "Sorry, I got the order of things mixed up in my testimony, Your Honor Sir! There was something I should have told you about first, Your Honor!",
      "Very well, Detective. Let's hear your testimony again."
      ],
    "ckpt7": [
      "There's one thing I want you to clarify for me here.",
      "You say that the victim, Mia Fey, wrote this note.",
      "That she was accusing the defendant, Maya Fey?",
      "That's really what you're saying?",
      "Wh-what? This isn't one of those lawyer tricks, now, is it?",
      "Of course she wrote it! Who else could have!?",
      "You have it backwards, Detective.",
      "This is a report from your department, Detective.",
      "Immediate death due to a blow from a blunt object.",
      "She died immediately!",
      "The prosecution's point being...?",
      "That autopsy report is outdat",
      "A second autopsy was performed yesterday, at my request!",
      "Death was almost immediate due to a blow from a blunt object...",
      "But there is a possibility the victim lived for several minutes after the blow.",
      "I received these results this morning.",
      "(Damn you, Edgeworth!)",
      "I should have known you'd have something up your sleeve!",
      "Why, Mr. Wright, you look shocked!",
      "This poor, innocent girl saw the murder with her own eyes!",
      "Let the witness Miss April May take the",
      "(Exactly what part of her is \"innocent\"...?)",
      "Witness, your name, please.",
      "The witness will refrain from wanton winking!",
      "(She's already captured the heart of every man in this courtroom!)",
      "Tell us, where were you on the night of September 5, when the murder occurred?",
      "Um... gee... I was, like, in my hotel room? Tee hee.",
      "I checked in right after lunch.",
      "And this hotel is directly across from the Fey & Co. Law Offices?",
      "Mmm... that's right, big boy."
    ],
    "ckpt8": [
      "Did you really see the defendant at all!?",
      "Yes, what is the meaning! Somebody tell me because I'm clueless! About this, I mean!",
      "If you had really witnessed my client, Maya Fey...",
      "You would have noticed her clothes before noticing her physique!",
      "No one wears clothes like this on a daily basis! Except her!",
      "And I'm no expert on fashion, but her hairdo looks far from normal to me!",
      "However, the witness's testimony mentions neither of these things!",
      "The testimony is bogus!",
      "And so did Detective Gumshoe!",
      "What do you say to that, Miss May?",
      "Rowr! What are you trying to say, you mean lawyer!",
      "I-I saw what I saw.",
      "I... just didn't think all the trifling little details were necessary, darling.",
      "Judge: Miss May.",
      "Judge: The court would like to remind you to please omit nothing in your testimony.",
      "I'm sorry, Your Honor. / I'll be a good girl. / I promise. \\*wink\\*",
      "Your testimony again, if you would.",
      "(Damn, I almost had her!)",
      "I did see everything! I did!",
      "The victim--the woman--dodged the first attack and ran off to the right.",
      "Then the girl in the hippie clothes ran after her...",
      "And she hit her with that weapon! I saw it! I did!",
      "That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?",
      "Well? Does the accuracy of my report not startle you? Tee hee!",
      "I only wish you had been so detailed from the beginning."
    ]
}