{
    "The First Turnabout": "Detailed Narrative Description:\nOn July 31, between 4 PM and 5 PM, model Cindy Stone was fatally bludgeoned in her downtown apartment with “The Thinker,” a heavy statue-clock handcrafted by her boyfriend Larry Butz; the building’s electricity was out from noon to 6 PM, leaving the cordless phone dead and masking the crime. Police arrested Larry on August 1, citing jealousy after Cindy had returned from Paris the previous day. Determined to repay his childhood friend, rookie attorney Phoenix Wright, under mentor Mia Fey, spent August 2 poring over the case file and securing the autopsy, blackout log, and other records. Court opened at 10:00 AM on August 3 in District Court No. 2. Prosecutor Winston Payne introduced the murder weapon and Cindy’s passport to frame Larry as a spurned lover. Payne’s star witness—newspaper salesman Frank Sahwit—claimed he saw Larry flee, discovered the body at 1 PM, and “heard” the time inside the apartment. Through four cross-examinations, Phoenix used the autopsy to disprove the 1 PM timeline, the blackout record to refute any working television, the statue’s hidden clock to show Sahwit had handled the weapon, and the passport to explain that the clock, having been set to Paris time, ran three hours slow locally—knowledge only the killer could possess. Cornered, Sahwit confessed, and Larry was acquitted before noon.\n\nComplete Evidence List:\n\"Attorney's Badge\" (Other) Relevance: Verifies Phoenix’s authority as defense counsel.\n\"Cindy's Autopsy Report\" (Reports) Relevance: Fixes time of death at 4-5 PM, contradicting Sahwit’s 1 PM claim.\n\"Statue\" (Weapons) Relevance: Revealed as a talking clock, proving Sahwit handled the murder weapon.\n\"Passport\" (Evidence) Relevance: Shows victim returned from Paris on 7/30, explaining the nine-hour offset that left the clock three hours slow locally.\n\"Blackout Record\" (Documents) Relevance: Confirms power outage, so no TV could announce the time at 1 PM.\n\nCross-Examination Breakdown:\nFrank Sahwit, Round 1\nStatement: “I remember the time exactly: It was 1:00 PM.”\nPresent: “Cindy's Autopsy Report.”\nContradiction Exposed: Death occurred “between 4 PM and 5 PM,” so the body could not be found at 1 PM.\nImpact: Shatters Sahwit’s initial timeline and credibility.\n\nFrank Sahwit, Round 2\nStatement: “You see, when I found the body, I heard the time. There was a voice saying the time… It was probably coming from the television.”\nPresent: “Blackout Record.”\nContradiction Exposed: Power outage from noon-6 PM meant no television could operate.\nImpact: Forces Sahwit to alter his story, revealing deeper inconsistency.\n\nFrank Sahwit, Round 3\nStatement: “There was a table clock in the apartment, wasn’t there! Yeah, the murder weapon! The killer used it to hit the victim!”\nPresent: “Statue.”\nContradiction Exposed: Object appears as a statue; only someone who handled it would know it is a clock, contradicting Sahwit’s claim he never entered the apartment.\nImpact: Links Sahwit directly to the weapon and the scene.\n\nFrank Sahwit, Round 4\nStatement: “Let's see this evidence that proves why the clock was running slow!”\nPresent: “Passport.”\nContradiction Exposed: Victim had just flown back from Paris (nine-hour difference); clock was never reset, so it ran three hours slow locally—proof Sahwit heard it while committing the murder.\nImpact: Explains time discrepancy, delivers decisive evidence, and secures Sahwit’s confession.",
    "Turnabout Sisters - (Part 1 to Part 4)": "Detailed Narrative Description:\nOn September 5 at 9:00 PM, Mia Fey was killed by a single blow from the hollow “The Thinker” clock-statue in the Fey & Co. Law Offices; she died almost instantly, yet a receipt beside her bearing “Maya” in blood framed her sister. Detective Dick Gumshoe arrested Maya early on September 6, seizing her cell phone and the autopsy report; rookie lawyer Phoenix Wright took her defense. Investigating the Gatewater Hotel opposite the office, Phoenix discovered a wiretap in guest April May’s room and learned from Marvin Grossberg that Bluecorp CEO Redd White had been black-mailing Mia. In court Phoenix proved Mia could not have written the bloody note, exposed April’s perjury by showing she only knew the weapon was a clock from the tapped call, and, via the bellboy, revealed a second guest—White—sharing May’s room at 9 PM. White’s testimony crumbled: conflicting directions of the victim’s flight, a claim of two blows versus the autopsy’s one, and an impossible view of a fallen glass light-stand from the hotel proved he was inside the office. A receipt dated September 4 showed the stand was purchased the day before, refuting White’s timeline; confronted with Mia’s secret memo of his black-mail victims, White confessed on September 7, clearing Maya.\n\nComplete Evidence List:\n\"Attorney's Badge\" (Other) Relevance: Confirms Phoenix’s legal standing.\n\"The Thinker\" (Weapon) Relevance: Murder weapon; empty casing proved April couldn’t have heard it ring.\n\"Glass Shards\" (Evidence) Relevance: Showed light-stand area invisible from hotel, placing White inside office.\n\"Receipt\" (Evidence) Relevance: Front shows glass stand bought Sept 4; back has “Maya,” disproving White’s story.\n\"Mia's Autopsy Report\" (Reports) Relevance: States death instantaneous, refuting note-writing.\n\"Maya's Cell Phone\" (Evidence) Relevance: Recording of Mia calling the statue a clock, which April learned via wiretap. And proving clockwork was removed pre-murder.\n\"Wiretap\" (Evidence) Relevance: Connects April May and Redd White to illegal surveillance.\n\"Floor Plans\" (Maps) Relevance: Show hotel view excludes fallen stand, contradicting White.\n\"May Testimony\" (Documents) Relevance: Victim ran right, later used to impeach White’s “ran left.”\n\"Mia's Memo\" (Documents) Relevance: List of powerful people White extorted, used to force confession.\n\nCross-Examination Breakdown:\n- **Detective Gumshoe, Round 1**\n  - Statement: “I found a memo written on a piece of paper next to the victim's body!“; “On it, the word “Maya“ was written clearly in blood!“; “Lab test results showed that the blood was the victim's!“; “Also, there was blood found on the victim's finger!”;”Before she died, the victim wrote the killer's name!”\n  - Present: ”Mia's Autopsy Report”\n  - Contradiction Exposed: Report says death instantaneous, so Mia could not have written anything.\n  - Impact: Undermines bloody-note claim.\n\n- **April May, Round 1**\n  - Statement: “That... that clock! Um... the kinda statue-y clock? ”The Thinker,” I think?”\n  - Present: ”The Thinker.”\n  - Contradiction Exposed: April casually calls the decorative statue a “clock”, she could know only by heard the sound before.\n  - Impact: Forces fuller account.\n\n- **April May, Round 2**\n  - Statement: “The evidence that proves when the clockwork was removed is...”\n  - Present: ”Maya's Cell Phone”\n  - Contradiction Exposed: Recording proves clockwork removed; nothing could ring.\n  - Impact: Shows she couldn’t know by sound.\n\n- **April May, Round 3**\n  - Statement: “Please produce this evidence that will prove the witness had not seen the clock before.”\n  - Present: ”The Thinker”\n  - Contradiction Exposed: ”The clock is handcrafted by Phoenix’s friend and never sold in stores, so April could not have recognized it beforehand.\n  - Impact: Shows she may held it before. \n\n- **April May, Round 4**\n  - Statement: ”How did the witness know ”The Thinker” was a clock?”; ”Show me evidence proving that the witness had ”heard” the murder weapon was a clock.”; ”Do you have proof that she knew of the conversation?.” \n  - Present: ”Wiretap”\n  - Contradiction Exposed: Wiretap shows she overheard Mia describe it.\n  - Impact: Breaks credibility and links to White.\n\n- **April May, Round 5**\n  - Statement: ”How did the witness know ”The Thinker” was a clock?”; ”The proof that the victim said, on the phone, that the weapon was a clock is...”; ”Show me evidence proving that the witness had ”heard” the murder weapon was a clock.” \n  - Present: ”Maya's Cell Phone”\n  - Contradiction Exposed: Maya's Cell Phone shows she overheard Mia describe it.\n  - Impact: Breaks credibility.\n\n- **Bellboy, Round 1**\n  - Statement: “At exactly 9:00 I delivered ice coffee to Miss May.”\n  - Present: (press cost → “coffee for two”)\n  - Contradiction Exposed: Reveals second guest.\n  - Impact: Places White with May.\n\n- **Redd White, Round 1**\n  - Statement: “The victim ran to the left, and you gave chase!”\n  - Present: May Testimony\n  - Contradiction Exposed: April said victim ran right; both cannot be true.\n  - Impact: Forces revision.\n\n- **Redd White, Round 2**\n  - Statement: “Next, with the last of her strength, she ran to the right.”; “You chased her, and delivered the final blow.”; “That is what Miss May saw.”; “You see? You hit her twice!”;\n  - Present: ”Mia's Autopsy Report”\n  - Contradiction Exposed: Autopsy shows single blow.\n  - Impact: Another revision.\n\n- **Redd White, Round 3**\n  - Statement: “A light stand was lying on the floor when I looked.”\n  - Present: Glass Shards or Floor Plans\n  - Contradiction Exposed: Stand not visible from hotel; only inside office.\n  - Impact: Puts White at scene.\n\n- **Redd White, Round 4**\n  - Statement: “It was the beginning of September... the week before the murder.”;“I had entered the Fey & Co. Law Offices.”; “Of course, I had done so to place the wiretap.”;  “That is when I saw this glass light stand.”\n  - Present: Receipt\n  - Contradiction Exposed: Stand bought Sept 4; could not have seen it earlier.\n  - Impact: Destroys timeline.\n\n- **Redd White, Round 5**\n  - Statement: “I have something I would like to read to the court!“\n  - Present: Mia's Memo\n  - Contradiction Exposed: Memo lists his black-mail victims; he confesses.\n  - Impact: Secures Maya’s acquittal."
}