{
    "The_First_Turnabout": {
        "name_mappings": {
            "phoenix": "lawyer 1",
            "mia": "mentor 1",
            "witness": "witness 1",
            "phoenix wright": "lawyer 1",
            "mr. wright": "lawyer 1",
            "wright": "lawyer 1",
            "mia fey": "mentor 1",
            "ms. fey": "mentor 1",
            "chief": "mentor 1",
            "judge": "judge 1",
            "your honor": "judge 1",
            "larry butz": "defendant 1",
            "mr. butz": "defendant 1",
            "the defendant": "defendant 1",
            "frank sahwit": "witness 1",
            "mr. sahwit": "witness 1",
            "sahwit": "witness 1",
            "sanwit": "witness 1",
            "the witness": "witness 1",
            "winston payne": "prosecutor 1",
            "mr. payne": "prosecutor 1",
            "payne": "prosecutor 1",
            "the prosecution": "prosecutor 1",
            "cindy stone": "victim 1",
            "ms. stone": "victim 1",
            "the victim": "victim 1",
            "the defense": "lawyer 1",
            "the court": "judge 1",
            "the killer": "witness 1",
            "the culprit": "witness 1"
        },
        "evidence_mappings": {
            "ATTORNEY'S BADGE": "E1",
            "CINDY'S AUTOPSY REPORT": "E2",
            "STATUE": "E3",
            "PASSPORT": "E4",
            "BLACKOUT RECORD": "E5"
        },
        "dialog": {
            "Sahwit: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.": "witness 1: I was going door-to-door selling magazine subscriptions when I spotted a man running out of an apartment.",
            "Sahwit: I thought he must be in a hurry because he left the door half-open behind him.": "witness 1: I assumed he must have been in a rush because he left the door partially open.",
            "Sahwit: Thinking it strange, I looked inside the apartment.": "witness 1: Finding it odd, I decided to peek inside the apartment.",
            "Sahwit: Then I saw her lying there... A woman... not moving... dead!": "witness 1: That's when I saw her... a woman... lying still... dead!",
            "Sahwit: I quailed in fright and found myself unable to go inside.": "witness 1: I froze in terror and couldn't bring myself to step inside.",
            "Sahwit: I thought to call the police immediately!": "witness 1: I immediately thought to contact the police!",
            "Sahwit: However, the phone in her apartment wasn't working.": "witness 1: But the phone inside the apartment wasn't working.",
            "Sahwit: I went to a nearby park and found a public phone.": "witness 1: So I hurried to a nearby park where there was a public telephone.",
            "Sahwit: I remember the time exactly: It was 1:00 PM.": "witness 1: I clearly remember the time: it was exactly 1:00 PM.",
            "Sahwit: The man who ran was, without a doubt, the defendant sitting right over there.": "witness 1: And the man who fled was, without a doubt, the defendant sitting right over there.",
            "Sahwit: You see, when I found the body, I heard the time.": "witness 1: Look, I heard the time when I discovered the body.",
            "Sahwit: There was a voice saying the time... It was probably coming from the television.": "witness 1: A voice announced the time... Likely from the TV.",
            "Sahwit: Oh, but it was three hours off, wasn't it?": "witness 1: Ah, but there was a three-hour discrepancy, correct?",
            "Sahwit: I guess the victim must have been watching a video of a taped program!": "witness 1: I suppose the victim 1 was viewing a recorded video!",
            "Sahwit: That's why I thought it was 1:00 PM!": "witness 1: That explains why I believed it was 1:00 PM!",
            "Sahwit: Terribly sorry about the misunderstanding...": "witness 1: My apologies for the confusion...",
            "Sahwit: Actually, I didn't \"hear\" the time... I \"saw\" it!": "witness 1: Actually, I didn't 'hear' the time... I observed it!",
            "Sahwit: There was a table clock in the apartment, wasn't there!": "witness 1: There was a desk clock in the apartment, correct!",
            "Sahwit: Yeah, the murder weapon! The killer used it to hit the victim!": "witness 1: Yes, the murder weapon! The killer 1 struck the victim 1 with it!",
            "Sahwit: That must have been what I saw.": "witness 1: That must be what I observed."
        }
    },
    "Turnabout_Sisters_part1": {
        "name_mappings": {
            "phoenix": "lawyer 1",
            "phoenix wright": "lawyer 1",
            "mr. wright": "lawyer 1",
            "wright": "lawyer 1",
            "the defense": "lawyer 1",
            "edgeworth": "prosecutor 1",
            "mr. edgeworth": "prosecutor 1",
            "the prosecution": "prosecutor 1",
            "mia": "mentor 1",
            "mia fey": "mentor 1",
            "ms. fey": "mentor 1",
            "the victim": "mentor 1",
            "chief": "mentor 1", 
            "maya": "defendant 1",
            "maya fey": "defendant 1",
            "ms. maya fey": "defendant 1",
            "the defendant": "defendant 1",
            "gumshoe": "detective 1",
            "detective gumshoe": "detective 1",
            "judge": "judge 1",
            "your honor": "judge 1",
            "april": "witness 1",
            "april may": "witness 1",
            "miss may": "witness 1",
            "bellboy": "witness 2", 
            "the witness": "witness 1",
            "fey & co. law offices": "law office"
        },
        "evidence_mappings": {
            "ATTORNEY'S BADGE": "E1",
            "MIA'S AUTOPSY REPORT": "E2",
            "MAYA'S CELL PHONE": "E3",
            "GLASS SHARDS": "E4",
            "THE THINKER": "E5",
            "WIRETAP": "E6",
            "RECEIPT": "E7",
            "FLOOR PLANS": "E8"
        },
        "dialog": {
            "Gumshoe: As soon as the phone call came in, I rushed to the scene!": "detective 1: I proceeded to the scene immediately upon receiving the call!",
            "Gumshoe: There were two people there already:": "detective 1: Two individuals were already present:",
            "Gumshoe: The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.": "detective 1: The defendant 1, and the lawyer 1.",
            "Gumshoe: I immediately arrested Ms. Maya Fey!": "detective 1: I promptly arrested defendant 1!",
            "Gumshoe: Why? We had a witness account describing her!": "detective 1: The reason? We had a witness statement identifying her!",
            "Gumshoe: The witness saw Ms. Maya Fey at the very moment of the murder!": "detective 1: The witness observed defendant 1 precisely when the murder occurred!",
            "Gumshoe: After securing the suspect, I examined the scene of the crime with my own eyes.": "detective 1: After securing the suspect, I personally examined the crime scene.",
            "Gumshoe: I found a memo written on a piece of paper next to the victim's body!": "detective 1: I discovered a note written on paper beside the victim's body!",
            "Gumshoe: On it, the word \"Maya\" was written clearly in blood!": "detective 1: On it, the name \"defendant 1\" was clearly written in blood!",
            "Gumshoe: Lab test results showed that the blood was the victim's!": "detective 1: Laboratory analysis confirmed the blood belonged to the victim!",
            "Gumshoe: Also, there was blood found on the victim's finger!": "detective 1: Additionally, blood was found on the victim's finger!",
            "Gumshoe: Before she died, the victim wrote the killer's name!": "detective 1: Before dying, the victim wrote the name of the killer!",
            "Gumshoe: How you like that? That's my \"hard evidence\"!": "detective 1: What do you think of that? That's my concrete evidence!",
            "April: It was, like, 9:00 at night. I looked out the window, y'know!": "witness 1: Around 9:00 PM, I happened to look out the window!",
            "April: And then, oooh! I saw a woman with long hair being attacked!": "witness 1: And then, wow! I observed a woman with long hair under attack!",
            "April: The one attacking her was the mousey girl sitting in the defendant's chair!": "witness 1: The attacker was the quiet-looking girl seated over there!",
            "April: Then the woman, like, dodged to one side and ran away!": "witness 1: The woman then sort of dodged aside and fled!",
            "April: But that girl, she caught up to her and... and... She hit her!": "witness 1: But the other girl pursued her and... and... struck her!",
            "April: Then the woman with the long hair...": "witness 1: Then the woman with the long hair...",
            "April: She kinda... slumped.": "witness 1: She kind of... collapsed.",
            "April: The end. That's all I saw. Every little bitsy witsy! *wink*": "witness 1: That concludes it. That's everything I witnessed!",
            "April: I did see everything! I did!": "witness 1: I truly saw everything!",
            "April: The victim--the woman--dodged the first attack and ran off to the right.": "witness 1: The victim -- the woman -- evaded the initial attack and fled to the right.",
            "April: Then the girl in the hippie clothes ran after her...": "witness 1: Then the girl dressed unconventionally pursued her...",
            "April: And she hit her with that weapon! I saw it! I did!": "witness 1: And struck her with the weapon! I saw it!",
            "April: That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?": "witness 1: That... that clock! Uh... the statue-like clock? E5, I believe?",
            "April: Well? Does the accuracy of my report not startle you? Tee hee!": "witness 1: Well? Isn't my report's accuracy surprising?",
            "Bellboy: I am the head bellboy at the fine Gatewater Hotel, in business for four generations!": "witness 2: I am the head bellboy at the Gatewater Hotel, a four-generation establishment!",
            "Bellboy: I believe I received a call after 8:00 in the evening from our guest, Miss May.": "witness 2: I recall receiving a call after 8 PM from our guest, witness 1.",
            "Bellboy: She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.": "witness 2: She requested an iced coffee be delivered exactly at 9:00.",
            "Bellboy: I brought it to her at precisely the requested time, of course.": "witness 2: Naturally, I delivered it precisely at the specified time.",
            "Bellboy: And I delivered the ice coffee to our guest Miss May, herself.": "witness 2: And I personally delivered the iced coffee to witness 1."
        }
    }
}