{
    "The_First_Turnabout": {
        "background_transcript": [
            "Phoenix: (I'm feeling extremely anxious!)",
            "Mia: Wright!",
            "Phoenix: Oh, h-hello there, Chief.",
            "Mia: Phew, fortunate I arrived in time. I must say Phoenix, you've impressed me! Not many would tackle a murder case as their first trial. That speaks volumes about you... and also about your client.",
            "Phoenix: Um... thank you. Actually, I'm doing it because I'm indebted to him.",
            "Mia: Indebted? So you were acquainted with the defendant prior to this case?",
            "Phoenix: Yes. In fact, I partly owe my current profession to him. He's partly responsible for my becoming an attorney.",
            "Mia: Well, that's surprising information!",
            "Phoenix: I wish to assist him however possible! I just... really need to help him. I owe him at least that much.",
            "???: (Everything's finished! My existence, everything, it's completely over!)",
            "Mia: ... Is that your client creating that commotion?",
            "Phoenix: Yes... that's him.",
            "???: (Death! Misery! Ohhhh! I'm going to end it all, I'm going to perish!!!)",
            "Mia: He appears suicidal...",
            "Phoenix: Um, indeed. *sigh*",
            "Butz: Nick!!!",
            "Phoenix: Hey. Hello, Larry.",
            "Butz: Man, I'm totally guilty!! Tell them I did it!!! Give me capital punishment! I'm not scared of dying!",
            "Phoenix: What!? What's troubling you, Larry?",
            "Butz: Oh, it's completely over... I... I'm done for. Finished! I cannot exist in a world without her! I can't! Who... who stole her from me, Nick? Who committed this act!? Oh, Nick, you must tell me! Who took my darling away!?",
            "Phoenix: (Hmm... The person behind your girlfriend's death? According to newspapers, it was you...)",
            "Phoenix: My name is Phoenix Wright. Here's what happened: My first legal case is relatively uncomplicated. A young woman was murdered in her residence. The person they detained was the unfortunate man dating her: Larry Butz... my best friend since childhood. In our school, there was a saying: 'When something smells, it's usually the Butz.' In the 23 years of our acquaintance, this has generally proven true. He has a tendency for finding himself in problematic situations. One thing I can say though: it's rarely his fault. He simply has awful luck. But I understand better than most that deep down, he's a decent person. That and I'm indebted to him. Which explains why I accepted the case... to establish his innocence. And that's precisely what I intend to do!",
            "Scene: August 3, 10:00 AM",
            "Scene: District Court",
            "Scene: Courtroom No. 2",
            "Judge: The court now begins the trial of Mr. Larry Butz.",
            "Payne: The prosecution is prepared, Your Honor.",
            "Phoenix: The, um, defense is prepared, Your Honor.",
            "Judge: Ahem. Mr. Wright? This is your inaugural trial, correct?",
            "Phoenix: Y-Yes, Your Honor. I'm, um, somewhat nervous.",
            "Judge: Your behavior during this proceeding will determine your client's destiny. Murder constitutes a severe accusation. For your client's benefit, I hope you can manage your anxiety.",
            "Phoenix: Thank... thank you, Your Honor.",
            "Judge: ... Mr. Wright, considering the situation... I believe we should conduct an assessment to verify your preparedness.",
            "Phoenix: Yes, Your Honor. (Gulp... Hands trembling... Vision... deteriorating...)",
            "Judge: The assessment will include several basic inquiries. Answer them clearly and succinctly. Please identify the defendant in this case.",
            "Phoenix: The defendant? That would be Larry Butz, Your Honor.",
            "Judge: Accurate. Simply maintain your composure and you'll perform adequately. Next question: This constitutes a murder trial. Tell me, what is the victim's identity?",
            "Phoenix: (Phew, I know this one! Fortunate that I reviewed the case file thoroughly multiple times. It's... wait... Oh no! No... impossible! I've forgotten! I'm experiencing complete mental emptiness!)",
            "Mia: Phoenix! Are you absolutely CONFIDENT about this? You can't even recall the victim's name!?",
            "Phoenix: Oh, the victim! O-Of course I know the victim's identity! I, um, just temporarily forgot.",
            "Mia: I believe I'm developing a headache. Look, the victim's identity is documented in the Court Record. Simply press [the R Button / Tab] to review it anytime, understood? Remember to check frequently. Do this for me, please. I'm imploring you.",
            "Judge: Mr. Wright. Who is the victim in this matter?",
            "Phoenix: Um... the victim is known as Cindy Stone.",
            "Judge: Accurate. Now, inform me, what caused her death? She died because she was...?",
            "Phoenix: She received a single blow from a blunt instrument.",
            "Judge: Accurate. You've addressed all my questions. I see no reason to delay proceedings. You appear much calmer, Mr. Wright. That's positive.",
            "Phoenix: Thank you, Your Honor. (Though I certainly don't FEEL calm.)",
            "Judge: Well, then... Initially, a question for the prosecution. Mr. Payne?",
            "Payne: Yes, Your Honor?",
            "Judge: As Mr. Wright just informed us, the victim was struck with a blunt instrument. Would you clarify for the court exactly what that 'instrument' was?",
            "Payne: The murder weapon was this sculpture of 'The Thinker.' It was discovered resting on the floor, adjacent to the victim.",
            "Judge: I see... The court admits it as evidence.",
            "Narration: Statue incorporated into the Court Record.",
            "Mia: Wright... Ensure you monitor any evidence introduced during the trial. That evidence constitutes your only resource in court. Utilize [the R Button / Tab] to examine the Court Record regularly.",
            "Judge: Mr. Payne, the prosecution may summon its initial witness.",
            "Payne: The prosecution calls the defendant, Mr. Butz, to testify.",
            "Phoenix: Um, Chief, what should I do now?",
            "Mia: Remain attentive. You don't want to miss any details that might benefit your client's defense. You'll receive your opportunity to counter the prosecution later, so be prepared! Let's just hope he avoids saying anything... problematic.",
            "Phoenix: (Uh oh, Larry becomes excited easily... This could be problematic.)",
            "Payne: Ahem. Mr. Butz. Isn't it factual that the victim had recently terminated your relationship?",
            "Butz: Hey, be careful friend! We had an excellent relationship! We were comparable to Romeo and Juliet, Cleopatra and Mark Anthony!",
            "Phoenix: (Um... didn't all those individuals perish?)",
            "Butz: I wasn't dumped! She simply wasn't accepting my calls. Or meeting me... at all. WHY DOES IT CONCERN YOU, ANYWAY!?",
            "Payne: Mr. Butz, what you're describing is typically what we refer to as 'dumped.' In reality, she had completely abandoned you... and was socializing with other men! She had just returned from abroad with one of them the day preceding the murder!",
            "Butz: What do you mean, 'one of them'!? Falsehoods! All completely false! I reject every word!",
            "Payne: Your Honor, the victim's passport. According to this document, she was in Paris until the day before her demise.",
            "Narration: Passport incorporated into the Court Record.",
            "Judge: Hmm... Indeed, she appears to have returned the day preceding the murder.",
            "Butz: Man... impossible...",
            "Payne: The victim worked as a model, but didn't earn substantial income. It seems she had several 'Sugar Daddies.'",
            "Butz: Daddies? Sugar?",
            "Payne: Yes. Older gentlemen who provided her money and presents. She accepted their financial support to maintain her lifestyle.",
            "Butz: Maaaan!",
            "Payne: We can clearly understand what kind of individual this Ms. Stone was. Tell me, Mr. Butz, how do you perceive her now?",
            "Mia: Wright... I don't believe you want him answering that question.",
            "Phoenix: (Yeah... Larry tends to speak impulsively in all the wrong ways. Should I...?)",
            "Butz: I'm going to expire. I'm simply going to collapse dead! Yeah, and when I encounter her in the afterlife... I'll uncover the truth about this!",
            "Judge: Let's resume the trial, shall we?",
            "Payne: I believe the accused's motivation is evident to everyone.",
            "Judge: Yes, undoubtedly.",
            "Phoenix: (Oh no. This situation appears extremely unfavorable.)",
            "Payne: Next question! You visited the victim's residence on the murder date, didn't you?",
            "Butz: Gulp!",
            "Payne: Well, did you, or didn't you?",
            "Butz: Heh? Heh heh. Well, perhaps I did, and perhaps I didn't!",
            "Phoenix: (Uh oh. He went there. What action should I take?)",
            "Judge: Well, that simplifies the situation. Who is your witness?",
            "Payne: The individual who discovered the victim's corpse. Immediately before making the grisly discovery... He observed the defendant escaping the crime scene!",
            "Judge: Order! Order in the courtroom! Mr. Payne, the prosecution may summon its witness.",
            "Payne: Yes, Your Honor.",
            "Phoenix: (This is problematic...)",
            "Payne: On the murder date, my witness was selling newspaper subscriptions at the victim's building. Please bring Mr. Frank Sahwit to the stand!",
            "Payne: Mr. Sahwit, you sell newspaper subscriptions, is this correct?",
            "Sahwit: Oh, oh yes! Newspapers, indeed!",
            "Judge: Mr. Sahwit, you may commence your testimony. Please inform the court about your observations on the murder date.",
            "Sahwit: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
            "Sahwit: I thought he must be in a hurry because he left the door half-open behind him.",
            "Sahwit: Thinking it strange, I looked inside the apartment.",
            "Sahwit: Then I saw her lying there... A woman... not moving... dead!",
            "Sahwit: I quailed in fright and found myself unable to go inside.",
            "Sahwit: I thought to call the police immediately!",
            "Sahwit: However, the phone in her apartment wasn't working.",
            "Sahwit: I went to a nearby park and found a public phone.",
            "Sahwit: I remember the time exactly: It was 1:00 PM.",
            "Sahwit: The man who ran was, without a doubt, the defendant sitting right over there.",
            "Judge: Hmm...",
            "Phoenix: (Larry! Why didn't you reveal the truth? I can't defend against such testimony!)",
            "Judge: Incidentally, why wasn't the telephone in the victim's residence operational?",
            "Payne: Your Honor, during the murder, there was a power outage in the building.",
            "Judge: Aren't telephones supposed to function during power outages?",
            "Payne: Yes, Your Honor... However, certain cordless telephones don't operate normally. The telephone that Mr. Sahwit attempted to use was one of those. Your Honor... I have documentation of the power outage for your review.",
            "Narration: Blackout Record incorporated into the Court Record.",
            "Judge: Now, Mr. Wright...",
            "Phoenix: Yes! Er... yes, Your Honor?",
            "Judge: You may commence your cross-examination.",
            "Phoenix: C-Cross-examination, Your Honor?",
            "Mia: Alright, Wright, this is the moment. The genuine challenge!",
            "Phoenix: Uh... what exactly should I do?",
            "Mia: Why, you expose the falsehoods in the testimony the witness just provided!",
            "Phoenix: Falsehoods! What?! He was being untruthful!?",
            "Mia: Your client is innocent, correct? Then that witness must have presented false testimony! Or is your client actually... guilty?",
            "Phoenix: !!! How can I demonstrate he's not?",
            "Mia: You possess the solution! It's in the evidence! Compare the witness's testimony with the available evidence. There must be a discrepancy somewhere! First, identify contradictions between the Court Record and the witness's testimony. Then, once you've located the contradicting evidence... present it and confront the witness with it!",
            "Phoenix: Um... understood.",
            "Mia: Access the Court Record with [the R Button / Tab], then highlight contradictions in the testimony!"
        ],
        "name_mappings": {
            "phoenix": "lawyer 1",
            "mia": "mentor 1",
            "witness": "witness 1",
            "phoenix wright": "lawyer 1",
            "mr. wright": "lawyer 1",
            "wright": "lawyer 1",
            "mia fey": "mentor 1",
            "ms. fey": "mentor 1",
            "chief": "mentor 1",
            "judge": "judge 1",
            "your honor": "judge 1",
            "larry butz": "defendant 1",
            "mr. butz": "defendant 1",
            "the defendant": "defendant 1",
            "frank sahwit": "witness 1",
            "mr. sahwit": "witness 1",
            "sahwit": "witness 1",
            "sanwit": "witness 1",
            "winston payne": "prosecutor 1",
            "mr. payne": "prosecutor 1",
            "payne": "prosecutor 1",
            "the prosecution": "prosecutor 1",
            "cindy stone": "victim 1",
            "ms. stone": "victim 1",
            "the victim": "victim 1",
            "the defense": "lawyer 1",
            "the court": "judge 1",
            "the killer": "witness 1",
            "the culprit": "witness 1"
        },
        "evidence_mappings": {
            "ATTORNEY'S BADGE": "E1",
            "CINDY'S AUTOPSY REPORT": "E2",
            "STATUE": "E3",
            "PASSPORT": "E4",
            "BLACKOUT RECORD": "E5"
        },
        "dialog": {
            "Sahwit: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.": "witness 1: I was going door-to-door selling magazine subscriptions when I spotted a man running out of an apartment.",
            "Sahwit: I thought he must be in a hurry because he left the door half-open behind him.": "witness 1: I assumed he must have been in a rush because he left the door partially open.",
            "Sahwit: Thinking it strange, I looked inside the apartment.": "witness 1: Finding it odd, I decided to peek inside the apartment.",
            "Sahwit: Then I saw her lying there... A woman... not moving... dead!": "witness 1: That's when I saw her... a woman... lying still... dead!",
            "Sahwit: I quailed in fright and found myself unable to go inside.": "witness 1: I froze in terror and couldn't bring myself to step inside.",
            "Sahwit: I thought to call the police immediately!": "witness 1: I immediately thought to contact the police!",
            "Sahwit: However, the phone in her apartment wasn't working.": "witness 1: But the phone inside the apartment wasn't working.",
            "Sahwit: I went to a nearby park and found a public phone.": "witness 1: So I hurried to a nearby park where there was a public telephone.",
            "Sahwit: I remember the time exactly: It was 1:00 PM.": "witness 1: I clearly remember the time: it was exactly 1:00 PM.",
            "Sahwit: The man who ran was, without a doubt, the defendant sitting right over there.": "witness 1: And the man who fled was, without a doubt, the defendant sitting right over there.",
            "Sahwit: You see, when I found the body, I heard the time.": "witness 1: Look, I heard the time when I discovered the body.",
            "Sahwit: There was a voice saying the time... It was probably coming from the television.": "witness 1: A voice announced the time... Likely from the TV.",
            "Sahwit: Oh, but it was three hours off, wasn't it?": "witness 1: Ah, but there was a three-hour discrepancy, correct?",
            "Sahwit: I guess the victim must have been watching a video of a taped program!": "witness 1: I suppose the victim 1 was viewing a recorded video!",
            "Sahwit: That's why I thought it was 1:00 PM!": "witness 1: That explains why I believed it was 1:00 PM!",
            "Sahwit: Terribly sorry about the misunderstanding...": "witness 1: My apologies for the confusion...",
            "Sahwit: Actually, I didn't \"hear\" the time... I \"saw\" it!": "witness 1: Actually, I didn't 'hear' the time... I observed it!",
            "Sahwit: There was a table clock in the apartment, wasn't there!": "witness 1: There was a desk clock in the apartment, correct!",
            "Sahwit: Yeah, the murder weapon! The killer used it to hit the victim!": "witness 1: Yes, the murder weapon! The killer 1 struck the victim 1 with it!",
            "Sahwit: That must have been what I saw.": "witness 1: That must be what I observed."
        }
    },
    "Turnabout_Sisters_part1": {
        "background_transcript": [
            "Cellular: Brrring... Brrrrring...",
            "*beep*",
            "???: Greetings? This is Maya speaking.",
            "Mia: Hello Maya, it's me.",
            "???: Mia! What's happening? It's been a while since you called.",
            "Mia: I apologize, I've been incredibly busy. How have you been?",
            "???: Well, ISOLATED. And it's entirely YOUR responsibility. No, I'm just joking. I've been wonderful! I'm gradually adjusting to having my own residence.",
            "Mia: That's wonderful to hear. Actually, I'm contacting you because I need a favor.",
            "???: I understand, I understand. You need me to safeguard evidence for you?",
            "Mia: Perceptive as always! There's considerable talk about the forthcoming trial... I simply don't feel secure keeping the evidence here.",
            "???: I understand. So, what is it this occasion?",
            "Mia: It's... a timepiece.",
            "???: A timepiece?",
            "Mia: Indeed, it's designed to resemble that sculpture, \"The Thinker.\" And it indicates the time! I thought you might appreciate it. You've always enjoyed novelties.",
            "???: Hey! I'm not a child anymore, Sis!",
            "Mia: Now, now. You know I'm only teasing. Ah, I should probably inform you, the clock isn't operational at present.",
            "???: Huh? It's malfunctioning? That's disappointing!",
            "Mia: I had to extract the clockwork. I apologize. I inserted some documents inside it instead.",
            "???: Documents? Is that the evidence, then? Hmm, well... there's a possibility that might be the case, yes.",
            "Mia: Could you visit the office tonight, around 9:00, to collect it? I'll be engaged in a pretrial meeting until then.",
            "???: Certainly, Sis, but I expect sustenance! Something delicious! Like... hamburgers! I could really enjoy a good hamburger.",
            "Mia: Alright, alright. We'll visit our regular establishment.",
            "???: Excellent! It's arranged! Okay, Sis, see you shortly!",
            "Mia: Yes. I'll be waiting, Maya.",
            "Cellular: *beep*",
            "[Conversation documented. September 5, 9:27 AM]",
            "Scene: Fey & Co. Law Offices",
            "???: Now, Miss Fey, I'll take what belongs to me... the documents.",
            "Mia: I'm sorry, but I cannot provide what I don't possess.",
            "???: Miss Fey, you are an ineffective deceiver. Why, I notice it right over there... That must be \"The Thinker\" that concealed those documents.",
            "Mia: How could you be aware...?",
            "???: Ho hoh. You are unaware of my background? Collecting information is my profession, you see.",
            "Mia: I... I should have exercised more caution.",
            "???: Ho hoh. My dear Miss Fey... I am deeply sorry. But I'm afraid I must request one additional thing. Your permanent silence... Farewell, Miss Fey.",
            "Mia: !!!",
            "Red... White... Blue...",
            "Scene: Fey & Co. Law Offices",
            "Phoenix: Oh no, I'm delayed. Hmm, that's peculiar. The chief must have departed already. She mentioned her sister was visiting so we should all dine together... ... What's that aroma...? Blood...? Mia! (Perhaps she's in her office!)",
            "Examine",
            "Phoenix: That scent... Blood!",
            "???: ... *sob* Sis...",
            "Phoenix: (Someone's present!) ...! Chief? Chief...?",
            "Phoenix: Chief!!!",
            "Phoenix: Who are you?",
            "???: ...",
            "Phoenix: (The unfamiliar girl fainted. I left her resting on the office couch. I returned to the chief where she lay beneath the window. Her body was still warm... I could sense it when I held her shoulder. Then, all too swiftly, it began to diminish... Until eventually she was cold.)",
            "Phoenix: Chief...",
            "*whee-ooo* *whee-ooo*... *whee-ooo* *whee-ooo*...",
            "Phoenix: ! The authorities! (Sounds like they're approaching!)",
            "Freeze! Police!",
            "Gumshoe: Alright, I'm Detective Dick Gumshoe, understand?",
            "Phoenix: (Gumshoe...? What a peculiar name.)",
            "Gumshoe: We received a notification from the building opposite, understand? Got a person claiming they witnessed a homicide.",
            "Phoenix: (It must have been that woman I observed.)",
            "Gumshoe: Anyway, I don't want either of you moving a centimeter, understand?",
            "Phoenix: (Wonderful. Just wonderful. Maya... Wait, she wouldn't have... no.)",
            "Gumshoe: Whoaaaaaaaaaaaah! Excuse me!",
            "Maya: Eek!",
            "Gumshoe: This term \"Maya\" here signify anything to you?",
            "Maya: ...! Um... that... That's my identity...",
            "Gumshoe: WHAAAAT!? The victim inscribed this note in her own blood, understand? With her final breath, she documented the murderer's name!",
            "Maya: K-killer...? I'm not--",
            "Gumshoe: Case resolved! You're coming to the station, ma'am.",
            "Maya: W-what?",
            "Phoenix: Mia's younger sister, Maya, was detained immediately. I was taken for interrogation and wasn't released until the following morning. My eyes were exhausted... but I couldn't rest. I remained, waiting for visiting hours to commence at the detention center. I needed to speak with Maya as quickly as possible.",
            "Scene: Detention Center - Visitor's Room",
            "Phoenix: (Wow, they have poor Maya confined like an offender.)",
            "Maya: Oh! It's you! The attorney... G-good morning.",
            "Phoenix: Good morning! (She appears so fatigued...)",
            "Maya: Um... Are you going to be my legal representative?",
            "Phoenix: Well, that's what I wanted to discuss with you...",
            "Maya: I-it's alright. I comprehend. ... And... I've also heard about you.",
            "Phoenix: Heard...? Heard what regarding me?",
            "Maya: I... was conversing with my sister on the telephone recently...",
            "Mia: \"Today was my junior colleague's first appearance in court.\"",
            "Maya: Wow! Really? How did that proceed?",
            "Mia: \"It was quite the spectacle! Honestly, I was anxious the entire time. It's been a while...\"",
            "Maya: Hah! So, he failed dismally?",
            "Mia: \"...He's brilliant. One of those 'instill fear in the hearts of evil' types... The only element he's lacking is... experience.\"",
            "Maya: Huh, sounds like it was entertaining! Well, I know who to approach if I ever encounter legal troubles now!",
            "Mia: \"I don't know, Maya. I think you might prefer to wait... give him three more years. That is, unless you want to be found guilty.\"",
            "Maya: That's what she expressed!",
            "Phoenix: ...",
            "Maya: I-I'm sorry! I didn't intend to burden you...",
            "Phoenix: No, it's fine. It's accurate, I suppose. But... simultaneously, I can't simply observe passively! When I consider the individual who did this to Mia...",
            "Maya: ... I understand...",
            "Maya: ... Um...!",
            "Phoenix: Huh? Is something troubling you?",
            "Maya: Um... I was wondering, could I request a favor?",
            "Phoenix: ...?",
            "Maya: This is the address of a renowned attorney. My sister provided this to me long ago. She said if I was ever in difficulty, I should contact him. And, well, I'm in difficulty. Do you think you could go ask him to represent me?",
            "Phoenix: (Hmm...)",
            "Maya: They informed me that if I don't secure one, the state will assign an attorney to defend me.",
            "Phoenix: When will that happen?",
            "Maya: They're allowing me until 4:00 this afternoon.",
            "Phoenix: (And visiting hours are nearly concluded... I'd better hasten!) Right, I'll return!",
            "Scene: Fey & Co. Law Offices",
            "Phoenix: (The office is crowded with police officers. They're all diligently searching for evidence...)",
            "???: Hey! You there! This is a crime scene, pal! No unauthorized entry! Umm... Sorry, don't I recognize you from somewhere? Wait, you're that Butz individual, aren't you!",
            "Phoenix: No, no, Phoenix Wright. (How could anyone confuse me for Larry!?)",
            "???: Ah, seems I misidentified the name, Mr. Wright. Sorry about that. That Butz individual, he was a murderer! And you're no murderer! Right?",
            "Phoenix: (He WAS proven innocent...) Umm... correct. And you were...",
            "Gumshoe: Anyway, get the name accurate. And don't address me as \"Dick\"...",
            "Police: Hey, Dick! Come over here!",
            "Gumshoe: Y-yes, sir! B-be there immediately! Umm... ahem! You're her attorney, correct, pal? If you have business here, you'd better conduct it rapidly!",
            "Phoenix: (Whew! He believes I'm Maya's attorney...!)",
            "Phoenix: (I suppose I've asked all the questions I need to.)",
            "Gumshoe: You all finished, pal?",
            "Phoenix: Um, yes, thank you. I'll be leaving now.",
            "Gumshoe: Oh, wait. One additional matter I wanted to mention to you. I don't suppose you're planning on speaking to that witness. Regardless, you'd better not! No influencing the witness with your lawyerly methods, pal!",
            "Phoenix: ... (Come to think of it, I had entirely forgotten about her...) The... witness?",
            "Gumshoe: Yeah, Miss April May. I'm sorry about this... But I can't tell you anything about her!",
            "Phoenix: (Well, you just disclosed her name. Miss May, huh?) So you've sent her home already, then?",
            "Gumshoe: Ahah! You're attempting your lawyerly tricks on me now! She's not to leave her room until the trial!",
            "Phoenix: (So... she's still in the hotel across the street.) I guess I should know better than to try to get a detective to divulge information.",
            "Gumshoe: You got that right, pal!",
            "Phoenix: (Time to visit Miss May!)",
            "Scene: Grossberg Law Offices",
            "Phoenix: (According to the receptionist, the senior partner is \"out\". She couldn't indicate when he'd return. It must be challenging to manage everything when you're a famous attorney... Not to mention operate an office like this. I guess I'll just have to return later.)",
            "Maya: Hey! What is it? Did you meet the attorney?",
            "Phoenix: Sorry. I haven't seen him yet.",
            "Maya: I see...",
            "Phoenix: (Hmm. I'd better go see if I can locate this elite attorney she's referring to.)",
            "Scene: Gatewater Hotel - Room 303",
            "April: Well! Hello there, handsome.",
            "Phoenix: Umm... hi. (Smooth, Wright, very smooth.)",
            "April: You're the lawyer, aren't you? The detective informed me... He said, \"Don't say anything to that lawyer, pal!\" Tee hee!",
            "Phoenix: (Memo to self: thank Detective Gumshoe for making my task more difficult.)",
            "April: Gee! This is all like something from a movie! It's all so thrilling I can barely contain myself! Ooh! Let me go refresh myself so I can look the part of the beautiful eyewitness!",
            "Phoenix: (I pity the attorney that has to cross-examine this one.)",
            "Phoenix: (There's a screwdriver protruding from this partially-open drawer. I wonder what's inside? Let's investigate...)",
            "April: Hey! H-h-hey!!! What are you doing!? No touching! Oooh. Naughty boy! Y-you really shouldn't pry into other people's rooms, now. You wouldn't want to upset me, would you?",
            "Phoenix: (Upset!? I thought she was going to explode momentarily! I wonder what could be inside the drawer?)",
            "Phoenix: (Hmm... it appears Mr. Grossberg is absent. Well, perhaps I should just wait here for him to return.)",
            "???: *Ah-HHHHEM!*",
            "Phoenix: (If that wasn't the most exaggerated throat clearing I've ever heard!)",
            "Grossberg: Ah hah! So, you're the one they say has been seeking me?",
            "Phoenix: Uh... y-yes, that's me! (He looks even... more imposing than I imagined!)",
            "Grossberg: Hmm...? That badge on your collar...? Ah, so you're an attorney, are you now?",
            "Phoenix: Y-yes, well... yes.",
            "Grossberg: And what do you want? I'm not especially occupied these days... Please, proceed!",
            "Phoenix: (Not occupied...? Then why could no one contact you?)",
            "Grossberg: Hmm? Something the matter? You came to see the one-and-only Marvin Grossberg, did you not? Well, here I am, young man! What do you want? Speak up!",
            "Phoenix: Um... w-well, sir, actually it's concerning Maya. Maya Fey.",
            "Grossberg: ...! Ah... yes. Maya Fey. Continue.",
            "Phoenix: (Hmm? Why the unusual reaction?)",
            "Grossberg: A-cha-cha. I'm really quite busy here, son. I can't accept cases on a day's notice! No, it's quite impossible.",
            "Phoenix: W-wait a moment! How did you know the trial was tomorrow!?",
            "Grossberg: Urk? Ahem! A-anyway... I'm afraid it's entirely impossible for me to represent her. Sorry. End of discussion.",
            "Phoenix: (What's occurring!? He refused me before I even had an opportunity to ask him! What do I tell Maya...?)",
            "Phoenix: ... (Looks like Detective Gumshoe has gone home. The police are still keeping themselves busy in the chief's office. No one has time to speak with me. Guess I'll head out.)",
            "Scene: Detention Center (after examining open drawer in Gatewater Hotel - Room 303, then visiting Grossberg Law Offices)",
            "Phoenix: Hmm... Maya's not here. She must be in questioning. They probably won't release her for a while. Maybe I'd better go speak to that attorney again.",
            "After clearing all Talk options in Grossberg Law Offices:",
            "Scene: Detention Center - Visitor's Room",
            "Phoenix: Hello.",
            "Maya: Oh! You're back! Did you find the attorney?",
            "Phoenix: Um... well... (What do I tell her?) Well, see... (Just be honest!) I... I really don't think you should use that guy. He... didn't appear healthy. He was exceedingly thin!",
            "Maya: ... What actually happened?",
            "Phoenix: ...",
            "Maya: You don't mean... He declined to help?",
            "Phoenix: Urp.",
            "Maya: ... I see. I've been forsaken, then.",
            "After clearing \"Your mother's enemy\" Talk option in Detention Center - Visitor's Room, if all Talk options have been cleared in Grossberg Law Offices",
            "Maya: Just a little longer now before the state-appointed attorney arrives, I guess...",
            "Phoenix: ... (4:00 PM. Time's up. What should I do? Do I just leave her and depart...?)",
            "Phoenix: I've made my decision! I'm going to defend you whether you desire it or not!",
            "Maya: ! Why?",
            "Phoenix: Why? Well...",
            "Phoenix: I won't desert you. You can depend on me.",
            "Maya: ... That's so kind of you... *sniff*... ...",
            "Phoenix: Well! Let's fight this case and secure your release!",
            "Maya: R-right! Thank you!",
            "Phoenix: (Whew, she smiled at last. She looks like a completely different person!) One final question... You are innocent, correct?",
            "Maya: Yes! And I trust you... So you trust me, too, okay?",
            "Phoenix: It's a deal. (So, what next... There's something that's been bothering me... Just what was inside that strange woman's drawer? It was when I attempted to look into the drawer that she became all defensive. There must be something in there!)",
            "Scene: Gatewater Hotel",
            "Bellboy: Good afternoon, sir!",
            "Phoenix: Excuse me, you are...?",
            "Bellboy: Ah, I beg your pardon, sir! I am the bellboy of this establishment, at your service, sir.",
            "Phoenix: Oh, right.",
            "Bellboy: I've just come up to deliver room service, sir.",
            "Phoenix: Um... do you know where Miss May might be?",
            "Bellboy: Ah. I believe our guest Miss May is currently using the, er, facilities...? If you've no need of anything, I'll be taking my leave. Please, stay as long as you wish. Enjoy...",
            "Phoenix: Yeah... Wait... no! Hey! ... (Why does it seem like every time I visit here, I end up embarrassing myself? Wait... now's my chance to investigate a bit!)",
            "Bellboy: Ah, I almost forgot!",
            "Phoenix: Gah! Y-you returned quickly!",
            "Bellboy: Might I ask you to inform Miss May that there is a message for her? Please tell her that Mr. White, of Bluecorp telephoned.",
            "Phoenix: Oh, right. Sure. (Mr. White... of Bluecorp? Where have I heard that name?)",
            "Maya: White... That was his name. My sister told me.",
            "Phoenix: (\"White\" was the name of the man who ruined Mia and Maya's mother! Could it be coincidental?)",
            "Phoenix: There's a screwdriver inserted in that partially-open drawer. Now's my opportunity to see what's inside! ...! What do we have here! A... wiretap? Hmm! What would a woman like her be doing with an item like this?",
            "Narration: Wiretap added to the Court Record.",
            "Phoenix: There is definitely something suspicious about this \"Miss May\"! Why would she have something like this in her hotel room? There's a narrative behind all this, I know it! Alright... I'll be using this piece of evidence in tomorrow's trial, that's certain. For Maya's sake... I'll get to the bottom of this woman's story! Wait... I mean ... you understand what I mean.",
            "April: Oh, bellboy...? Still there?",
            "Phoenix: (Uh oh, time to flee! I look forward to confronting you tomorrow, Miss May! In court!)",
            "September 7, 10:00 AM",
            "Scene: District Court - Courtroom No. 1",
            "Judge: The court is now in session for the trial of Ms. Maya Fey.",
            "Edgeworth: The prosecution is ready, Your Honor.",
            "Phoenix: The defense is ready, Your Honor. (Miles Edgeworth... I'd better not display any signs of weakness today, or he'll be upon me instantly.)",
            "Judge: Mr. Edgeworth. Please provide the court your opening statement.",
            "Edgeworth: Thank you, Your Honor. The defendant, Ms. Maya Fey, was at the crime scene. The prosecution has evidence she committed this murder... and we have a witness who saw her commit it. The prosecution sees no reason to doubt the facts of this case, Your Honor.",
            "Judge: I see. Thank you, Mr. Edgeworth. Let's begin then.",
            "Edgeworth: If we may call our first witness, Your Honor. The prosecution calls the chief officer at the scene, Detective Gumshoe!",
            "Edgeworth: Witness, please state your name and occupation to the court.",
            "Gumshoe: Sir! My name's Dick Gumshoe, sir! I'm the detective in charge of homicides down at the precinct, sir!",
            "Edgeworth: Detective Gumshoe. Please, describe for us the specifics of this murder.",
            "Gumshoe: Very well, sir! Let me use this floor map of the office to explain. The body was found by this window, here.",
            "Edgeworth: And the cause of death?",
            "Gumshoe: Blood loss due to being struck by a blunt object, sir! The murder weapon was a statue of \"The Thinker\" found next to the body, sir! It was substantial enough to be a deadly weapon, even in a girl's hands, sir!",
            "Judge: The court accepts the statue as evidence.",
            "Phoenix: (They're still calling it a \"statue\"...)",
            "Narration: Floor Plans added to the Court Record.",
            "Edgeworth: Now, Detective...",
            "Gumshoe: Y-yes sir!",
            "Edgeworth: You immediately arrested Ms. Maya Fey, who was found at the scene, correct? Can you tell me why?",
            "Gumshoe: Yes sir! I had conclusive evidence she did it, sir!",
            "Judge: Hmm. Detective Gumshoe. Please testify to the court about this \"conclusive evidence.\"",
            "Witness Testimony",
            "-- Maya Fey's Arrest --",
            "Gumshoe: As soon as the phone call came in, I rushed to the scene!",
            "Gumshoe: There were two people there already:",
            "Gumshoe: The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.",
            "Gumshoe: I immediately arrested Ms. Maya Fey!",
            "Gumshoe: Why? We had a witness account describing her!",
            "Gumshoe: The witness saw Ms. Maya Fey at the very moment of the murder!",
            "Judge: Hmm... The very moment, you say. Very well. Mr. Wright, you may begin your cross-examination.",
            "Phoenix: Y-yes, Your Honor. (Cross-examine what...? I couldn't identify a single contradiction in that testimony...)",
            "...whoosh...",
            "SMACK!",
            "Phoenix: (Hey! Maya just threw something at me... What's this? \"When my sister couldn't find any contradictions in a witness's testimony she would bluff it and press the witness on every detail! The witness always slips up and says something incorrect... It worked numerous times!\" Heh... I should have expected Maya would know some of her sister's techniques! Alright. Let's attempt this!)",
            "Judge: Something the matter?",
            "Phoenix: No, Your Honor. I'd like to begin my cross-examination."
        ],
        "name_mappings": {
            "phoenix": "lawyer 1",
            "phoenix wright": "lawyer 1",
            "mr. wright": "lawyer 1",
            "wright": "lawyer 1",
            "the defense": "lawyer 1",
            "edgeworth": "prosecutor 1",
            "mr. edgeworth": "prosecutor 1",
            "the prosecution": "prosecutor 1",
            "mia": "mentor 1",
            "mia fey": "mentor 1",
            "ms. fey": "mentor 1",
            "the victim": "mentor 1",
            "chief": "mentor 1", 
            "maya": "defendant 1",
            "maya fey": "defendant 1",
            "ms. maya fey": "defendant 1",
            "the defendant": "defendant 1",
            "gumshoe": "detective 1",
            "detective gumshoe": "detective 1",
            "judge": "judge 1",
            "your honor": "judge 1",
            "april": "witness 1",
            "april may": "witness 1",
            "miss may": "witness 1",
            "bellboy": "witness 2", 
            "fey & co. law offices": "law office"
        },
        "evidence_mappings": {
            "ATTORNEY'S BADGE": "E1",
            "MIA'S AUTOPSY REPORT": "E2",
            "MAYA'S CELL PHONE": "E3",
            "GLASS SHARDS": "E4",
            "THE THINKER": "E5",
            "WIRETAP": "E6",
            "RECEIPT": "E7",
            "FLOOR PLANS": "E8"
        },
        "dialog": {
            "Gumshoe: As soon as the phone call came in, I rushed to the scene!": "detective 1: I proceeded to the scene immediately upon receiving the call!",
            "Gumshoe: There were two people there already:": "detective 1: Two individuals were already present:",
            "Gumshoe: The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.": "detective 1: The defendant 1, and the lawyer 1.",
            "Gumshoe: I immediately arrested Ms. Maya Fey!": "detective 1: I promptly arrested defendant 1!",
            "Gumshoe: Why? We had a witness account describing her!": "detective 1: The reason? We had a witness statement identifying her!",
            "Gumshoe: The witness saw Ms. Maya Fey at the very moment of the murder!": "detective 1: The witness observed defendant 1 precisely when the murder occurred!",
            "Gumshoe: After securing the suspect, I examined the scene of the crime with my own eyes.": "detective 1: After securing the suspect, I personally examined the crime scene.",
            "Gumshoe: I found a memo written on a piece of paper next to the victim's body!": "detective 1: I discovered a note written on paper beside the victim's body!",
            "Gumshoe: On it, the word \"Maya\" was written clearly in blood!": "detective 1: On it, the name \"defendant 1\" was clearly written in blood!",
            "Gumshoe: Lab test results showed that the blood was the victim's!": "detective 1: Laboratory analysis confirmed the blood belonged to the victim!",
            "Gumshoe: Also, there was blood found on the victim's finger!": "detective 1: Additionally, blood was found on the victim's finger!",
            "Gumshoe: Before she died, the victim wrote the killer's name!": "detective 1: Before dying, the victim wrote the name of the killer!",
            "Gumshoe: How you like that? That's my \"hard evidence\"!": "detective 1: What do you think of that? That's my concrete evidence!",
            "April: It was, like, 9:00 at night. I looked out the window, y'know!": "witness 1: Around 9:00 PM, I happened to look out the window!",
            "April: And then, oooh! I saw a woman with long hair being attacked!": "witness 1: And then, wow! I observed a woman with long hair under attack!",
            "April: The one attacking her was the mousey girl sitting in the defendant's chair!": "witness 1: The attacker was the quiet-looking girl seated over there!",
            "April: Then the woman, like, dodged to one side and ran away!": "witness 1: The woman then sort of dodged aside and fled!",
            "April: But that girl, she caught up to her and... and... She hit her!": "witness 1: But the other girl pursued her and... and... struck her!",
            "April: Then the woman with the long hair...": "witness 1: Then the woman with the long hair...",
            "April: She kinda... slumped.": "witness 1: She kind of... collapsed.",
            "April: The end. That's all I saw. Every little bitsy witsy! *wink*": "witness 1: That concludes it. That's everything I witnessed!",
            "April: I did see everything! I did!": "witness 1: I truly saw everything!",
            "April: The victim--the woman--dodged the first attack and ran off to the right.": "witness 1: The victim -- the woman -- evaded the initial attack and fled to the right.",
            "April: Then the girl in the hippie clothes ran after her...": "witness 1: Then the girl dressed unconventionally pursued her...",
            "April: And she hit her with that weapon! I saw it! I did!": "witness 1: And struck her with the weapon! I saw it!",
            "April: That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?": "witness 1: That... that clock! Uh... the statue-like clock? E5, I believe?",
            "April: Well? Does the accuracy of my report not startle you? Tee hee!": "witness 1: Well? Isn't my report's accuracy surprising?",
            "Bellboy: I am the head bellboy at the fine Gatewater Hotel, in business for four generations!": "witness 2: I am the head bellboy at the Gatewater Hotel, a four-generation establishment!",
            "Bellboy: I believe I received a call after 8:00 in the evening from our guest, Miss May.": "witness 2: I recall receiving a call after 8 PM from our guest, witness 1.",
            "Bellboy: She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.": "witness 2: She requested an iced coffee be delivered exactly at 9:00.",
            "Bellboy: I brought it to her at precisely the requested time, of course.": "witness 2: Naturally, I delivered it precisely at the specified time.",
            "Bellboy: And I delivered the ice coffee to our guest Miss May, herself.": "witness 2: And I personally delivered the iced coffee to witness 1."
        }
    }
}